#include <stdio.h>
main()
{
	int a[3], * p;
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p・・・%d\n", *p);//取り出し値をそのまま表示
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p+1・・・%d\n", *p + 1);//取り出した値＋１を表示
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*(p+1)・・・%d\n", *(p + 1));//アドレスを一つ分(intなら4bit)進めてから取り出す
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p+=1・・・%d\n", *p += 1);//
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p++・・・%d\n", *p++);
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("(*p)++・・・%d\n", (*p)++);//「後置き」その行の処理がすべて終わってから実行される
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*++p・・・%d\n", *++p);//「前置き」は先に計算が行われる
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("++*p・・・%d\n", ++*p);//「前置き」は先に計算が行われる ++(*p)と同じ
}